# # var = 6
# # 666
# # 1666
# # 2666
# # 3666
# # 4666
# # 5666
# #
# # if i = var:
# #   for n in range(10):
# #       뒤에다붙이지말고 앞에붙인뒤
# #   i += 9
# #   var = i+10
# # 6660    6
# # 6661
# # 6662
# # 6663
# # 6664
# # 6665
# # 6666
# # 6667
# # 6668
# # 6669    15
# #
# # 7666
# # 8666
# # 9666
# # 10666
# # 11666
# # 12666
# # 13666
# # 14666
# # 15666
# #
# # 16660 7
# # 16661
# # 16662
# # 16663
# # 16664
# # 16665
# # 16666
# # 16667
# # 16668
# # 16669 16
# #
# # 17666
#
# def i_hate_this(num):
#     for i in range(num):
#         if i >6 and i <17:
#             series = str(666)+str()

# 생각해보니까 브루트포스문제면 그냥 이렇게할필요없이 숫자일일히 카운팅하면될듯...

inp = int(input())
i = 0
confirm_me = 0
while True:
    if i == inp:
        print(confirm_me)
        break
    else:
        confirm_me += 1
        if '666' in str(confirm_me):
            i += 1